oc2k/Pic16/HT-pic/include/pic16f88x.h
 /*
  * #ifndef	_HTC_H_
  * #warning Header file pic16f887.h included directly. Use #include <htc.h> instead.
  * #endif

  * header file for the MICROCHIP PIC microcontroller
  *	16F882
  * 16F883
  * 16F884
  * 16F886
  * 16F887
  */
/////////////////////////////////////////////////////////////////////////////////////
////History//////////////////////////////////////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////
// -2008 July31-  Copy from new HitechC and Reference Pic1687x.h ////////////////////
// -2008 Aug12-  ErrCode for WDTCON-CM2CON1  ////////////////////////////////////////
/////////////////////////////////////////////////////////////////////////////////////

#if defined(_16F882)	|| defined(_16F883)	|| defined(_16F884)	||\
    defined(_16F886)	|| defined(_16F887)
#else
#error "Wrong Pic"
#endif
#ifndef	__PIC16F88x_H
#define	__PIC16F88x_H

// Special function register definitions

static volatile unsigned char	INDF	@ 0x00;
static volatile unsigned char	TMR0	@ 0x01;
static volatile unsigned char	PCL	@ 0x02;
static volatile unsigned char	STATUS	@ 0x03;
static          unsigned char	FSR	@ 0x04;
static volatile unsigned char	PORTA	@ 0x05;
static volatile unsigned char	PORTB	@ 0x06;
static volatile unsigned char	PORTC	@ 0x07;
#if defined(_16F884) || defined(_16F887)
static volatile unsigned char	PORTD	@ 0x08;
#endif
static volatile unsigned char		PORTE	@ 0x09;
static          unsigned char	PCLATH	@ 0x0A;
static volatile unsigned char	INTCON	@ 0x0B;
static volatile unsigned char	PIR1	@ 0x0C;
static volatile unsigned char	PIR2	@ 0x0D;
static volatile unsigned char	TMR1L	@ 0x0E;
static volatile unsigned char	TMR1H	@ 0x0F;
static volatile unsigned char	T1CON	@ 0x10;
static volatile unsigned char	TMR2	@ 0x11;
static volatile unsigned char	T2CON	@ 0x12;
static volatile unsigned char	SSPBUF	@ 0x13;
static volatile unsigned char	SSPCON	@ 0x14;
static volatile unsigned char	CCPR1L	@ 0x15;
static volatile unsigned char	CCPR1H	@ 0x16;
static volatile unsigned char	CCP1CON	@ 0x17;
static volatile unsigned char	RCSTA	@ 0x18;
static volatile unsigned char	TXREG	@ 0x19;
static volatile unsigned char	RCREG	@ 0x1A;
static volatile unsigned char	CCPR2L	@ 0x1B;
static volatile unsigned char	CCPR2H	@ 0x1C;
static volatile unsigned char	CCP2CON	@ 0x1D;
static volatile unsigned char	ADRESH	@ 0x1E;
static volatile unsigned char	ADCON0	@ 0x1F;

/*	bank 1 registers */
static          unsigned char bank1	OPTION	@ 0x81;
static volatile	unsigned char bank1	TRISA	@ 0x85;
static volatile	unsigned char bank1	TRISB	@ 0x86;
static volatile	unsigned char bank1	TRISC	@ 0x87;
#if defined(_16F884) || defined(_16F887)
static volatile unsigned char bank1	TRISD	@ 0x88;
#endif
static volatile unsigned char bank1	TRISE	@ 0x89;
static volatile unsigned char bank1	PIE1	@ 0x8C;
static volatile unsigned char bank1	PIE2	@ 0x8D;
static volatile unsigned char bank1	PCON	@ 0x8E;
static volatile unsigned char bank1 OSCCON		@ 0x08F; //88x
static volatile unsigned char bank1 OSCTUNE		@ 0x090; //88x
static volatile unsigned char bank1	SSPCON2	@ 0x91;
static volatile unsigned char bank1	PR2	@ 0x92;
static volatile unsigned char bank1	SSPADD	@ 0x93;
//static volatile unsigned char bank1 SSPMSK	@ 0x093; //88x
static volatile unsigned char bank1	SSPSTAT	@ 0x94;
static volatile unsigned char bank1 WPUB		@ 0x095; //88x
static volatile unsigned char bank1 IOCB		@ 0x096; //88x
static volatile unsigned char bank1	VRCON		@ 0x097; //88x
static volatile unsigned char bank1	TXSTA	@ 0x98;
static volatile unsigned char bank1	SPBRG	@ 0x99;
static volatile unsigned char bank1	SPBRGH		@ 0x09A; //88x
static volatile unsigned char bank1	PWM1CON		@ 0x09B; //88x
static volatile unsigned char bank1	ECCPAS		@ 0x09C; //88x
static volatile unsigned char bank1	PSTRCON		@ 0x09D; //88x
static volatile unsigned char bank1	ADRESL	@ 0x9E;
static volatile unsigned char bank1	ADCON1	@ 0x9F;
/*	bank 2 registers */
static volatile unsigned char bank2	WDTCON		@ 0x105; //88x
static volatile unsigned char bank2	CM1CON0		@ 0x107; //88x
static volatile unsigned char bank2	CM2CON0		@ 0x108; //88x
static volatile unsigned char bank2	CM2CON1		@ 0x109; //88x
static volatile unsigned char bank2	EEDAT		@ 0x10C; //88x
/* Alternate definition */
static volatile unsigned char bank2	EEDATA	@ 0x10C;
static volatile unsigned char bank2	EEADR	@ 0x10D;
/* Alternate definition */
static volatile unsigned char bank2	EEADRL		@ 0x10D; //88x
static volatile unsigned char bank2	EEDATH	@ 0x10E;
static volatile unsigned char bank2	EEADRH	@ 0x10F;

/*	bank 3 registers */
static volatile unsigned char bank3	SRCON		@ 0x185; //88x
static volatile unsigned char bank3	BAUDCTL		@ 0x187; //88x
static volatile unsigned char bank3	ANSEL		@ 0x188; //88x
static volatile unsigned char bank3	ANSELH		@ 0x189; //88x
static volatile unsigned char bank3	EECON1	@ 0x18C;
static volatile unsigned char bank3	EECON2	@ 0x18D;

/*	STATUS bits	*/
/* Definitions for STATUS register */
static volatile bit	IRP     @ (unsigned)&STATUS*8+7;
static volatile bit	RP1     @ (unsigned)&STATUS*8+6;
static volatile bit	RP0     @ (unsigned)&STATUS*8+5;
static volatile bit	TO	@ (unsigned)&STATUS*8+4;
static volatile bit	PD	@ (unsigned)&STATUS*8+3;
static volatile bit	ZERO    @ (unsigned)&STATUS*8+2;
static volatile bit	DC      @ (unsigned)&STATUS*8+1;
static volatile bit	CARRY   @ (unsigned)&STATUS*8+0;

/*      PORTA bits      */
/* Definitions for PORTA register */
static volatile bit	RA7				@ ((unsigned)&PORTA*8)+7; //88x
static volatile bit	RA6				@ ((unsigned)&PORTA*8)+6; //88x
static volatile bit	RA5	@ (unsigned)&PORTA*8+5;
static volatile bit	RA4	@ (unsigned)&PORTA*8+4;
static volatile bit	RA3	@ (unsigned)&PORTA*8+3;
static volatile bit	RA2	@ (unsigned)&PORTA*8+2;
static volatile bit	RA1	@ (unsigned)&PORTA*8+1;
static volatile bit	RA0	@ (unsigned)&PORTA*8+0;

/*      PORTB bits      */
/* Definitions for PORTB register */
static volatile bit	RB7	@ (unsigned)&PORTB*8+7;
static volatile bit	RB6	@ (unsigned)&PORTB*8+6;
static volatile bit	RB5	@ (unsigned)&PORTB*8+5;
static volatile bit	RB4	@ (unsigned)&PORTB*8+4;
static volatile bit	RB3	@ (unsigned)&PORTB*8+3;
static volatile bit	RB2	@ (unsigned)&PORTB*8+2;
static volatile bit	RB1	@ (unsigned)&PORTB*8+1;
static volatile bit	RB0	@ (unsigned)&PORTB*8+0;

/*      PORTC bits      */
/* Definitions for PORTC register */
static volatile bit	RC7	@ (unsigned)&PORTC*8+7;
static volatile bit	RC6	@ (unsigned)&PORTC*8+6;
static volatile bit	RC5	@ (unsigned)&PORTC*8+5;
static volatile bit	RC4	@ (unsigned)&PORTC*8+4;
static volatile bit	RC3	@ (unsigned)&PORTC*8+3;
static volatile bit	RC2	@ (unsigned)&PORTC*8+2;
static volatile bit	RC1	@ (unsigned)&PORTC*8+1;
static volatile bit	RC0	@ (unsigned)&PORTC*8+0;

/*      PORTD bits      */
#if defined(_16F884) || defined(_16F887)
/* Definitions for PORTD register */
static volatile bit	RD7	@ (unsigned)&PORTD*8+7;
static volatile bit	RD6	@ (unsigned)&PORTD*8+6;
static volatile bit	RD5	@ (unsigned)&PORTD*8+5;
static volatile bit	RD4	@ (unsigned)&PORTD*8+4;
static volatile bit	RD3	@ (unsigned)&PORTD*8+3;
static volatile bit	RD2	@ (unsigned)&PORTD*8+2;
static volatile bit	RD1	@ (unsigned)&PORTD*8+1;
static volatile bit	RD0	@ (unsigned)&PORTD*8+0;

