oc2k/Pic16/HT-pic/include/pic16f88x.h
/*      PORTE bits      */
/* Definitions for PORTE register */
static volatile bit	RE2	@ (unsigned)&PORTE*8+2;
static volatile bit	RE1	@ (unsigned)&PORTE*8+1;
static volatile bit	RE0	@ (unsigned)&PORTE*8+0;
#endif
static volatile bit	RE3			@ ((unsigned)&PORTE*8)+3; //88x

/*	INTCON bits	*/
/* Definitions for INTCON register */
static volatile bit	GIE	@ (unsigned)&INTCON*8+7;
static volatile bit	PEIE	@ (unsigned)&INTCON*8+6;
static volatile bit	T0IE	@ (unsigned)&INTCON*8+5;
static volatile bit	INTE	@ (unsigned)&INTCON*8+4;
// Alternate definition for backward compatibility
//static volatile bit	RABIE		@ ((unsigned)&INTCON*8)+3; //88x
static volatile bit	RBIE	@ (unsigned)&INTCON*8+3;
static volatile bit	T0IF	@ (unsigned)&INTCON*8+2;
static volatile bit	INTF	@ (unsigned)&INTCON*8+1;
static volatile bit	RBIF	@ (unsigned)&INTCON*8+0;
// alternate definitions
static volatile bit	TMR0IE	@ (unsigned)&INTCON*8+5;
static volatile bit	TMR0IF	@ (unsigned)&INTCON*8+2;
// Alternate definition for backward compatibility
//static volatile bit	RABIF		@ ((unsigned)&INTCON*8)+0; //88x

/*	PIR1 bits	*/
/* Definitions for PIR1 register */
//static volatile bit	PSPIF	@ (unsigned)&PIR1*8+7; //87x
static volatile bit	ADIF	@ (unsigned)&PIR1*8+6;
static volatile bit	RCIF	@ (unsigned)&PIR1*8+5;
static volatile bit	TXIF	@ (unsigned)&PIR1*8+4;
static volatile bit	SSPIF	@ (unsigned)&PIR1*8+3;
static volatile bit	CCP1IF	@ (unsigned)&PIR1*8+2;
static volatile bit	TMR2IF	@ (unsigned)&PIR1*8+1;
static volatile bit	TMR1IF	@ (unsigned)&PIR1*8+0;

/*	PIR2 bits	*/
/* Definitions for PIR2 register */
static volatile bit	OSFIF			@ ((unsigned)&PIR2*8)+7; //88x
static volatile bit	C2IF			@ ((unsigned)&PIR2*8)+6; //88x
static volatile bit	C1IF			@ ((unsigned)&PIR2*8)+5; //88x
static volatile bit	EEIF	@ (unsigned)&PIR2*8+4;
static volatile bit	BCLIF	@ (unsigned)&PIR2*8+3;
static volatile bit	ULPWUIF			@ ((unsigned)&PIR2*8)+2; //88x
static volatile bit	CCP2IF	@ (unsigned)&PIR2*8+0;

/*	T1CON bits	*/
/* Definitions for T1CON register */
static			bit	T1GINV			@ ((unsigned)&T1CON*8)+7; //88x
static			bit	TMR1GE			@ ((unsigned)&T1CON*8)+6; //88x
static volatile bit	T1CKPS1	@ (unsigned)&T1CON*8+5;
static volatile bit	T1CKPS0	@ (unsigned)&T1CON*8+4;
static volatile bit	T1OSCEN	@ (unsigned)&T1CON*8+3;
static volatile bit	T1SYNC 	@ (unsigned)&T1CON*8+2;
static volatile bit	TMR1CS 	@ (unsigned)&T1CON*8+1;
static volatile bit	TMR1ON 	@ (unsigned)&T1CON*8+0;

/*	T2CON bits	*/
/* Definitions for T2CON register */
static volatile bit	TOUTPS3	@ (unsigned)&T2CON*8+6;
static volatile bit	TOUTPS2	@ (unsigned)&T2CON*8+5;
static volatile bit	TOUTPS1	@ (unsigned)&T2CON*8+4;
static volatile bit	TOUTPS0	@ (unsigned)&T2CON*8+3;
static volatile bit	TMR2ON 	@ (unsigned)&T2CON*8+2;
static volatile bit	T2CKPS1	@ (unsigned)&T2CON*8+1;
static volatile bit	T2CKPS0	@ (unsigned)&T2CON*8+0;

/*	SSPCON bits	*/
/* Definitions for SSPCON register */
static volatile bit	WCOL	@ (unsigned)&SSPCON*8+7;
static volatile bit	SSPOV	@ (unsigned)&SSPCON*8+6;
static volatile bit	SSPEN	@ (unsigned)&SSPCON*8+5;
static volatile bit	CKP	@ (unsigned)&SSPCON*8+4;
static volatile bit	SSPM3	@ (unsigned)&SSPCON*8+3;
static volatile bit	SSPM2	@ (unsigned)&SSPCON*8+2;
static volatile bit	SSPM1	@ (unsigned)&SSPCON*8+1;
static volatile bit	SSPM0	@ (unsigned)&SSPCON*8+0;

/*	CCP1CON bits	*/
/* Definitions for CCP1CON register */
static			bit	P1M1			@ ((unsigned)&CCP1CON*8)+7; //88x
static			bit	P1M0			@ ((unsigned)&CCP1CON*8)+6; //88x
static			bit	DC1B1			@ ((unsigned)&CCP1CON*8)+5; //88x
static			bit	DC1B0			@ ((unsigned)&CCP1CON*8)+4; //88x
//static volatile bit	CCP1X	@ (unsigned)&CCP1CON*8+5; //87x
//static volatile bit	CCP1Y	@ (unsigned)&CCP1CON*8+4; //87x
static volatile bit	CCP1M3	@ (unsigned)&CCP1CON*8+3;
static volatile bit	CCP1M2	@ (unsigned)&CCP1CON*8+2;
static volatile bit	CCP1M1	@ (unsigned)&CCP1CON*8+1;
static volatile bit	CCP1M0	@ (unsigned)&CCP1CON*8+0;

/*	RCSTA bits	*/
/* Definitions for RCSTA register */
static volatile bit	SPEN	@ (unsigned)&RCSTA*8+7;
static volatile bit	RX9 	@ (unsigned)&RCSTA*8+6;
static volatile bit	SREN	@ (unsigned)&RCSTA*8+5;
static volatile bit	CREN	@ (unsigned)&RCSTA*8+4;
static volatile bit	ADDEN	@ (unsigned)&RCSTA*8+3;
static volatile bit	FERR	@ (unsigned)&RCSTA*8+2;
static volatile bit	OERR	@ (unsigned)&RCSTA*8+1;
static volatile bit	RX9D	@ (unsigned)&RCSTA*8+0;

/*	CCP2CON bits	*/
/* Definitions for CCP2CON register */
static volatile bit	CCP2X	@ (unsigned)&CCP2CON*8+5;
static volatile bit	CCP2Y	@ (unsigned)&CCP2CON*8+4;
static volatile bit	CCP2M3	@ (unsigned)&CCP2CON*8+3;
static volatile bit	CCP2M2	@ (unsigned)&CCP2CON*8+2;
static volatile bit	CCP2M1	@ (unsigned)&CCP2CON*8+1;
static volatile bit	CCP2M0	@ (unsigned)&CCP2CON*8+0;

/*	 ADCON0 bits	*/
/* Definitions for ADCON0 register */
static volatile bit	ADCS1	@ (unsigned)&ADCON0*8+7;
static volatile bit	ADCS0 	@ (unsigned)&ADCON0*8+6;
static volatile bit	CHS3			@ (unsigned)&ADCON0*8+5; //88x
static volatile bit	CHS2			@ (unsigned)&ADCON0*8+4; //88x
static volatile bit	CHS1			@ (unsigned)&ADCON0*8+3; //88x
static volatile bit	CHS0			@ (unsigned)&ADCON0*8+2; //88x
static volatile bit	ADGO			@ (unsigned)&ADCON0*8+1; //88x
static volatile bit	ADON	@ (unsigned)&ADCON0*8+0;

/* 	OPTION bits	*/
/* Definitions for OPTION register */
//static bank1 bit	RABPU			@ ((unsigned)&OPTION*8)+7; //88x
// Alternate definition for backward compatibility
static bank1 bit	RBPU	@ (unsigned)&OPTION*8+7;
static bank1 bit	INTEDG	@ (unsigned)&OPTION*8+6;
static bank1 bit	T0CS	@ (unsigned)&OPTION*8+5;
static bank1 bit	T0SE	@ (unsigned)&OPTION*8+4;
static bank1 bit	PSA	@ (unsigned)&OPTION*8+3;
static bank1 bit	PS2	@ (unsigned)&OPTION*8+2;
static bank1 bit	PS1	@ (unsigned)&OPTION*8+1;
static bank1 bit	PS0	@ (unsigned)&OPTION*8+0;

/*      TRISA bits      */
/* Definitions for TRISA register */
static volatile bank1 bit	TRISA7		@ ((unsigned)&TRISA*8)+7; //88x
static volatile bank1 bit	TRISA6		@ ((unsigned)&TRISA*8)+6; //88x
static volatile bank1 bit	TRISA5	@ (unsigned)&TRISA*8+5;
static volatile bank1 bit	TRISA4	@ (unsigned)&TRISA*8+4;
static volatile bank1 bit	TRISA3	@ (unsigned)&TRISA*8+3;
static volatile bank1 bit	TRISA2	@ (unsigned)&TRISA*8+2;
static volatile bank1 bit	TRISA1	@ (unsigned)&TRISA*8+1;
static volatile bank1 bit	TRISA0	@ (unsigned)&TRISA*8+0;

