oc2k/Pic16/HT-pic/include/pic16f88x.h
/*      TRISB bits      */
/* Definitions for TRISB register */
static volatile bank1 bit	TRISB7	@ (unsigned)&TRISB*8+7;
static volatile bank1 bit	TRISB6	@ (unsigned)&TRISB*8+6;
static volatile bank1 bit	TRISB5	@ (unsigned)&TRISB*8+5;
static volatile bank1 bit	TRISB4	@ (unsigned)&TRISB*8+4;
static volatile bank1 bit	TRISB3	@ (unsigned)&TRISB*8+3;
static volatile bank1 bit	TRISB2	@ (unsigned)&TRISB*8+2;
static volatile bank1 bit	TRISB1	@ (unsigned)&TRISB*8+1;
static volatile bank1 bit	TRISB0	@ (unsigned)&TRISB*8+0;

/*      TRISC bits      */
/* Definitions for TRISC register */
static volatile bank1 bit	TRISC7	@ (unsigned)&TRISC*8+7;
static volatile bank1 bit	TRISC6	@ (unsigned)&TRISC*8+6;
static volatile bank1 bit	TRISC5	@ (unsigned)&TRISC*8+5;
static volatile bank1 bit	TRISC4	@ (unsigned)&TRISC*8+4;
static volatile bank1 bit	TRISC3	@ (unsigned)&TRISC*8+3;
static volatile bank1 bit	TRISC2	@ (unsigned)&TRISC*8+2;
static volatile bank1 bit	TRISC1	@ (unsigned)&TRISC*8+1;
static volatile bank1 bit	TRISC0	@ (unsigned)&TRISC*8+0;

#if defined(_16F884) || defined(_16F887)
/*      TRISD bits      */
/* Definitions for TRISD register */
static volatile bank1 bit	TRISD7	@ (unsigned)&TRISD*8+7;
static volatile bank1 bit	TRISD6	@ (unsigned)&TRISD*8+6;
static volatile bank1 bit	TRISD5	@ (unsigned)&TRISD*8+5;
static volatile bank1 bit	TRISD4	@ (unsigned)&TRISD*8+4;
static volatile bank1 bit	TRISD3	@ (unsigned)&TRISD*8+3;
static volatile bank1 bit	TRISD2	@ (unsigned)&TRISD*8+2;
static volatile bank1 bit	TRISD1	@ (unsigned)&TRISD*8+1;
static volatile bank1 bit	TRISD0	@ (unsigned)&TRISD*8+0;

/*      TRISE bits      */
/* Definitions for TRISE register */
//static volatile bank1 bit	IBF			@ (unsigned)&TRISE*8+7; //87x
//static volatile bank1 bit	OBF			@ (unsigned)&TRISE*8+6; //87x
//static volatile bank1 bit	IBOV		@ (unsigned)&TRISE*8+5; //87x
//static volatile bank1 bit	PSPMODE		@ (unsigned)&TRISE*8+4; //87x
static volatile bank1 bit	TRISE2  @ (unsigned)&TRISE*8+2;
static volatile bank1 bit	TRISE1  @ (unsigned)&TRISE*8+1;
static volatile bank1 bit	TRISE0  @ (unsigned)&TRISE*8+0;
#endif
static volatile bank1 bit	TRISE3	  @ (unsigned)&TRISE*8+3; //88x

/*	PIE1 bits	*/
/* Definitions for PIE1 register */
//static volatile bank1 bit	PSPIE		@ (unsigned)&PIE1*8+7; //87x
static volatile bank1 bit	ADIE	@ (unsigned)&PIE1*8+6;
static volatile bank1 bit	RCIE	@ (unsigned)&PIE1*8+5;
static volatile bank1 bit	TXIE	@ (unsigned)&PIE1*8+4;
static volatile bank1 bit	SSPIE	@ (unsigned)&PIE1*8+3;
static volatile bank1 bit	CCP1IE	@ (unsigned)&PIE1*8+2;
static volatile bank1 bit	TMR2IE	@ (unsigned)&PIE1*8+1;
static volatile bank1 bit	TMR1IE	@ (unsigned)&PIE1*8+0;

/*	PIE2 bits	*/
/* Definitions for PIE2 register */
static volatile bank1 bit	OSFIE		@ ((unsigned)&PIE2*8)+7; //88x
static volatile bank1 bit	C2IE		@ ((unsigned)&PIE2*8)+6; //88x
static volatile bank1 bit	C1IE		@ ((unsigned)&PIE2*8)+5; //88x
static volatile bank1 bit	EEIE	@ (unsigned)&PIE2*8+4;
static volatile bank1 bit	BCLIE	@ (unsigned)&PIE2*8+3;
static volatile bank1 bit	ULPWUIE		@ ((unsigned)&PIE2*8)+2; //88x
static volatile bank1 bit	CCP2IE	@ (unsigned)&PIE2*8+0;

/*	PCON bits	*/
/* Definitions for PCON register */
static volatile bank1 bit	ULPWUE		@ ((unsigned)&PCON*8)+5; //88x
static volatile bank1 bit	SBOREN		@ ((unsigned)&PCON*8)+4; //88x
static volatile bank1 bit	POR	@ (unsigned)&PCON*8+1;	
static volatile bank1 bit	BOR	@ (unsigned)&PCON*8+0;	

/* Definitions for OSCCON register */
static 			bank1 bit	IRCF2		@ ((unsigned)&OSCCON*8)+6;
static 			bank1 bit	IRCF1		@ ((unsigned)&OSCCON*8)+5;
static 			bank1 bit	IRCF0		@ ((unsigned)&OSCCON*8)+4;
static volatile bank1 bit	OSTS		@ ((unsigned)&OSCCON*8)+3; //88x
static volatile bank1 bit	HTS			@ ((unsigned)&OSCCON*8)+2; //88x
static volatile bank1 bit	LTS			@ ((unsigned)&OSCCON*8)+1; //88x
static 			bank1 bit	SCS		@ ((unsigned)&OSCCON*8)+0;

/* Definitions for OSCTUNE register */
static 			bank1 bit	TUN4		@ ((unsigned)&OSCTUNE*8)+4; //88x
static 			bank1 bit	TUN3		@ ((unsigned)&OSCTUNE*8)+3; //88x
static 			bank1 bit	TUN2		@ ((unsigned)&OSCTUNE*8)+2; //88x
static 			bank1 bit	TUN1		@ ((unsigned)&OSCTUNE*8)+1; //88x
static 			bank1 bit	TUN0		@ ((unsigned)&OSCTUNE*8)+0; //88x

/*	SSPCON2 bits */
/* Definitions for SSPCON2 register */
static volatile bank1 bit	GCEN	@ (unsigned)&SSPCON2*8+7;
static volatile bank1 bit	ACKSTAT	@ (unsigned)&SSPCON2*8+6;
static volatile bank1 bit	ACKDT	@ (unsigned)&SSPCON2*8+5;
static volatile bank1 bit	ACKEN	@ (unsigned)&SSPCON2*8+4;
static volatile bank1 bit	RCEN	@ (unsigned)&SSPCON2*8+3;
static volatile bank1 bit	PEN	@ (unsigned)&SSPCON2*8+2;
static volatile bank1 bit	RSEN	@ (unsigned)&SSPCON2*8+1;
static volatile bank1 bit	SEN	@ (unsigned)&SSPCON2*8+0;


/*      SSPSTAT bits    */
/* Definitions for SSPSTAT register */
static volatile bank1 bit	STAT_SMP	@ (unsigned)&SSPSTAT*8+7;
static volatile bank1 bit	STAT_CKE	@ (unsigned)&SSPSTAT*8+6;
static volatile bank1 bit	STAT_DA		@ (unsigned)&SSPSTAT*8+5;
static volatile bank1 bit	STAT_P		@ (unsigned)&SSPSTAT*8+4;
static volatile bank1 bit	STAT_S		@ (unsigned)&SSPSTAT*8+3;
static volatile bank1 bit	STAT_RW		@ (unsigned)&SSPSTAT*8+2;
static volatile bank1 bit	STAT_UA		@ (unsigned)&SSPSTAT*8+1;
static volatile bank1 bit	STAT_BF		@ (unsigned)&SSPSTAT*8+0;

/* Definitions for WPUB register */
static 			bank1 bit	WPUB0		@ ((unsigned)&WPUB*8)+0; //88x
static 			bank1 bit	WPUB1		@ ((unsigned)&WPUB*8)+1; //88x
static 			bank1 bit	WPUB2		@ ((unsigned)&WPUB*8)+2; //88x
static 			bank1 bit	WPUB3		@ ((unsigned)&WPUB*8)+3; //88x
static 			bank1 bit	WPUB4		@ ((unsigned)&WPUB*8)+4; //88x
static 			bank1 bit	WPUB5		@ ((unsigned)&WPUB*8)+5; //88x
static 			bank1 bit	WPUB6		@ ((unsigned)&WPUB*8)+6; //88x
static 			bank1 bit	WPUB7		@ ((unsigned)&WPUB*8)+7; //88x

/* Definitions for IOCB register */
static 			bank1 bit	IOCB0		@ ((unsigned)&IOCB*8)+0; //88x
static 			bank1 bit	IOCB1		@ ((unsigned)&IOCB*8)+1; //88x
static 			bank1 bit	IOCB2		@ ((unsigned)&IOCB*8)+2; //88x
static 			bank1 bit	IOCB3		@ ((unsigned)&IOCB*8)+3; //88x
static 			bank1 bit	IOCB4		@ ((unsigned)&IOCB*8)+4; //88x
static 			bank1 bit	IOCB5		@ ((unsigned)&IOCB*8)+5; //88x
static 			bank1 bit	IOCB6		@ ((unsigned)&IOCB*8)+6; //88x
static 			bank1 bit	IOCB7		@ ((unsigned)&IOCB*8)+7; //88x

