oc2k/Pic16/HT-pic/include/pic16f88x.h
/* Definitions for VRCON register */
static 			bank1 bit	VR0			@ ((unsigned)&VRCON*8)+0; //88x
static 			bank1 bit	VR1			@ ((unsigned)&VRCON*8)+1; //88x
static 			bank1 bit	VR2			@ ((unsigned)&VRCON*8)+2; //88x
static 			bank1 bit	VR3			@ ((unsigned)&VRCON*8)+3; //88x
static 			bank1 bit	VRSS		@ ((unsigned)&VRCON*8)+4; //88x
static 			bank1 bit	VRR			@ ((unsigned)&VRCON*8)+5; //88x
static 			bank1 bit	VROE		@ ((unsigned)&VRCON*8)+6; //88x
static 			bank1 bit	VREN		@ ((unsigned)&VRCON*8)+7; //88x

/*	TXSTA bits	*/
/* Definitions for TXSTA register */
static volatile bank1 bit	CSRC	@ (unsigned)&TXSTA*8+7;
static volatile bank1 bit	TX9	@ (unsigned)&TXSTA*8+6;
static volatile bank1 bit	TXEN	@ (unsigned)&TXSTA*8+5;
static volatile bank1 bit	SYNC	@ (unsigned)&TXSTA*8+4;
static 			bank1 bit	SENDB			@ ((unsigned)&TXSTA*8)+3; //88x
static volatile bank1 bit	BRGH	@ (unsigned)&TXSTA*8+2;
static volatile bank1 bit	TRMT	@ (unsigned)&TXSTA*8+1;
static volatile bank1 bit	TX9D	@ (unsigned)&TXSTA*8+0;

/* Definitions for SPBRG register */
static 			bank1 bit	BRG0		@ ((unsigned)&SPBRG*8)+0; //88x
static 			bank1 bit	BRG1		@ ((unsigned)&SPBRG*8)+1; //88x
static 			bank1 bit	BRG2		@ ((unsigned)&SPBRG*8)+2; //88x
static 			bank1 bit	BRG3		@ ((unsigned)&SPBRG*8)+3; //88x
static 			bank1 bit	BRG4		@ ((unsigned)&SPBRG*8)+4; //88x
static 			bank1 bit	BRG5		@ ((unsigned)&SPBRG*8)+5; //88x
static 			bank1 bit	BRG6		@ ((unsigned)&SPBRG*8)+6; //88x
static 			bank1 bit	BRG7		@ ((unsigned)&SPBRG*8)+7; //88x

/* Definitions for SPBRGH register */
static 			bank1 bit	BRG8		@ ((unsigned)&SPBRGH*8)+0; //88x
static 			bank1 bit	BRG9		@ ((unsigned)&SPBRGH*8)+1; //88x
static 			bank1 bit	BRG10		@ ((unsigned)&SPBRGH*8)+2; //88x
static 			bank1 bit	BRG11		@ ((unsigned)&SPBRGH*8)+3; //88x
static 			bank1 bit	BRG12		@ ((unsigned)&SPBRGH*8)+4; //88x
static 			bank1 bit	BRG13		@ ((unsigned)&SPBRGH*8)+5; //88x
static 			bank1 bit	BRG14		@ ((unsigned)&SPBRGH*8)+6; //88x
static 			bank1 bit	BRG15		@ ((unsigned)&SPBRGH*8)+7; //88x

/* Definitions for PWM1CON register */
static volatile bank1 bit	PDC0		@ ((unsigned)&PWM1CON*8)+0; //88x
static volatile bank1 bit	PDC1		@ ((unsigned)&PWM1CON*8)+1; //88x
static volatile bank1 bit	PDC2		@ ((unsigned)&PWM1CON*8)+2; //88x
static volatile bank1 bit	PDC3		@ ((unsigned)&PWM1CON*8)+3; //88x
static volatile bank1 bit	PDC4		@ ((unsigned)&PWM1CON*8)+4; //88x
static volatile bank1 bit	PDC5		@ ((unsigned)&PWM1CON*8)+5; //88x
static volatile bank1 bit	PDC6		@ ((unsigned)&PWM1CON*8)+6; //88x
static volatile bank1 bit	PRSEN		@ ((unsigned)&PWM1CON*8)+7; //88x

/* Definitions for ECCPAS register */
static 			bank1 bit	PSSBD0		@ ((unsigned)&ECCPAS*8)+0; //88x
static 			bank1 bit	PSSBD1		@ ((unsigned)&ECCPAS*8)+1; //88x
static 			bank1 bit	PSSAC0		@ ((unsigned)&ECCPAS*8)+2; //88x
static 			bank1 bit	PSSAC1		@ ((unsigned)&ECCPAS*8)+3; //88x
static 			bank1 bit	ECCPAS0		@ ((unsigned)&ECCPAS*8)+4; //88x
static 			bank1 bit	ECCPAS1		@ ((unsigned)&ECCPAS*8)+5; //88x
static 			bank1 bit	ECCPAS2		@ ((unsigned)&ECCPAS*8)+6; //88x
static volatile bank1 bit	ECCPASE		@ ((unsigned)&ECCPAS*8)+7; //88x

/* Definitions for PSTRCON register */
static 			bank1 bit	STRA		@ ((unsigned)&PSTRCON*8)+0; //88x
static 			bank1 bit	STRB		@ ((unsigned)&PSTRCON*8)+1; //88x
static 			bank1 bit	STRC		@ ((unsigned)&PSTRCON*8)+2; //88x
static 			bank1 bit	STRD		@ ((unsigned)&PSTRCON*8)+3; //88x
static 			bank1 bit	STRSYNC		@ ((unsigned)&PSTRCON*8)+4; //88x

/*	ADCON1 bits	*/
/* Definitions for ADCON1 register */
static volatile bank1 bit	ADFM	@ (unsigned)&ADCON1*8+7;
static 			bank1 bit	VCFG1		@ ((unsigned)&ADCON1*8)+5; //88x
static 			bank1 bit	VCFG0		@ ((unsigned)&ADCON1*8)+4; //88x
//static volatile bank1 bit	PCFG3		@ (unsigned)&ADCON1*8+3; //87x
//static volatile bank1 bit	PCFG2		@ (unsigned)&ADCON1*8+2; //87x
//static volatile bank1 bit	PCFG1		@ (unsigned)&ADCON1*8+1; //87x
//static volatile bank1 bit	PCFG0		@ (unsigned)&ADCON1*8+0; //87x

/* Definitions for WDTCON register */
static 			bank1 bit	SWDTEN		@ ((unsigned)&WDTCON*8)+0; //88x
static 			bank1 bit	WDTPS0		@ ((unsigned)&WDTCON*8)+1; //88x
static 			bank1 bit	WDTPS1		@ ((unsigned)&WDTCON*8)+2; //88x
static 			bank1 bit	WDTPS2		@ ((unsigned)&WDTCON*8)+3; //88x
static 			bank1 bit	WDTPS3		@ ((unsigned)&WDTCON*8)+4; //88x

/* Definitions for CM1CON0 register */
static 			bank1 bit	C1CH0		@ ((unsigned)&CM1CON0*8)+0; //88x
static 			bank1 bit	C1CH1		@ ((unsigned)&CM1CON0*8)+1; //88x
static 			bank1 bit	C1R			@ ((unsigned)&CM1CON0*8)+2; //88x
static 			bank1 bit	C1POL		@ ((unsigned)&CM1CON0*8)+4; //88x
static 			bank1 bit	C1OE		@ ((unsigned)&CM1CON0*8)+5; //88x
static volatile bank1 bit	C1OUT		@ ((unsigned)&CM1CON0*8)+6; //88x
static 			bank1 bit	C1ON		@ ((unsigned)&CM1CON0*8)+7; //88x

/* Definitions for CM2CON0 register */
static 			bank1 bit	C2CH0		@ ((unsigned)&CM2CON0*8)+0; //88x
static 			bank1 bit	C2CH1		@ ((unsigned)&CM2CON0*8)+1; //88x
static 			bank1 bit	C2R			@ ((unsigned)&CM2CON0*8)+2; //88x
static 			bank1 bit	C2POL		@ ((unsigned)&CM2CON0*8)+4; //88x
static 			bank1 bit	C2OE		@ ((unsigned)&CM2CON0*8)+5; //88x
static volatile bank1 bit	C2OUT		@ ((unsigned)&CM2CON0*8)+6; //88x
static 			bank1 bit	C2ON		@ ((unsigned)&CM2CON0*8)+7; //88x

/* Definitions for CM2CON1 register */
static 			bank1 bit	C2SYNC		@ ((unsigned)&CM2CON1*8)+0; //88x
static 			bank1 bit	T1GSS		@ ((unsigned)&CM2CON1*8)+1; //88x
static 			bank1 bit	C2RSEL		@ ((unsigned)&CM2CON1*8)+4; //88x
static 			bank1 bit	C1RSEL		@ ((unsigned)&CM2CON1*8)+5; //88x
static volatile bank1 bit	MC2OUT		@ ((unsigned)&CM2CON1*8)+6; //88x
static volatile bank1 bit	MC1OUT		@ ((unsigned)&CM2CON1*8)+7; //88x

/* Definitions for SRCON register */
static 			bank3 bit	FVREN		@ ((unsigned)&SRCON*8)+0; //88x
static volatile bank3 bit	PULSR		@ ((unsigned)&SRCON*8)+2; //88x
static volatile bank3 bit	PULSS		@ ((unsigned)&SRCON*8)+3; //88x
static 			bank3 bit	C2REN		@ ((unsigned)&SRCON*8)+4; //88x
static 			bank3 bit	C1SEN		@ ((unsigned)&SRCON*8)+5; //88x
static 			bank3 bit	SR0			@ ((unsigned)&SRCON*8)+6; //88x
static 			bank3 bit	SR1			@ ((unsigned)&SRCON*8)+7; //88x

/* Definitions for BAUDCTL register */
static volatile bank3 bit	ABDEN		@ ((unsigned)&BAUDCTL*8)+0; //88x
static volatile bank3 bit	WUE			@ ((unsigned)&BAUDCTL*8)+1; //88x
static 			bank3 bit	BRG16		@ ((unsigned)&BAUDCTL*8)+3; //88x
static volatile bank3 bit	SCKP		@ ((unsigned)&BAUDCTL*8)+4; //88x
static volatile bank3 bit	RCIDL		@ ((unsigned)&BAUDCTL*8)+6; //88x
static volatile bank3 bit	ABDOVF		@ ((unsigned)&BAUDCTL*8)+7; //88x

/* Definitions for ANSEL register */
static 			bank3 bit	ANS0		@ ((unsigned)&ANSEL*8)+0; //88x
static 			bank3 bit	ANS1		@ ((unsigned)&ANSEL*8)+1; //88x
static 			bank3 bit	ANS2		@ ((unsigned)&ANSEL*8)+2; //88x
static 			bank3 bit	ANS3		@ ((unsigned)&ANSEL*8)+3; //88x
static 			bank3 bit	ANS4		@ ((unsigned)&ANSEL*8)+4; //88x
#if defined(_16F884) || defined(_16F887)
static 			bank3 bit	ANS5		@ ((unsigned)&ANSEL*8)+5; //88x
static 			bank3 bit	ANS6		@ ((unsigned)&ANSEL*8)+6; //88x
static 			bank3 bit	ANS7		@ ((unsigned)&ANSEL*8)+7; //88x
#endif

/* Definitions for ANSELH register */
static 			bank3 bit	ANS8		@ ((unsigned)&ANSELH*8)+0; //88x
static 			bank3 bit	ANS9		@ ((unsigned)&ANSELH*8)+1; //88x
static 			bank3 bit	ANS10		@ ((unsigned)&ANSELH*8)+2; //88x
static 			bank3 bit	ANS11		@ ((unsigned)&ANSELH*8)+3; //88x
static 			bank3 bit	ANS12		@ ((unsigned)&ANSELH*8)+4; //88x
static 			bank3 bit	ANS13		@ ((unsigned)&ANSELH*8)+5; //88x

/*	EECON1 bits */
/* Definitions for EECON1 register */
static volatile bank3 bit	EEPGD	@ (unsigned)&EECON1*8+7;
static volatile bank3 bit	WRERR	@ (unsigned)&EECON1*8+3;
static volatile bank3 bit	WREN	@ (unsigned)&EECON1*8+2;
static volatile bank3 bit	WR	@ (unsigned)&EECON1*8+1;
static volatile bank3 bit	RD	@ (unsigned)&EECON1*8+0;

#define EEPROM_SIZE	256
/* macro versions of EEPROM write and read */
#define	EEPROM_WRITE(addr, value) while(WR)continue;EEADR=(addr);EEDATA=(value); \
					EECON1&=0x7F;CARRY=0;if(GIE)CARRY=1;GIE=0; \
					WREN=1;EECON2=0x55;EECON2=0xAA;WR=1;WREN=0; \
					if(CARRY)GIE=1

#define	EEPROM_READ(addr) ((EEADR=(addr)),(EECON1&=0x7F),(RD=1),EEDATA)
					
/* macro versions of Flash read and write */
#define FLASH_WRITE(addr, value)	EEADR=((addr)&0xff);	\
					EEADRH=((addr)>>8);	\
					EEDATH=((value)>>8);	\
					EEDATA=((value)&0xff);	\
					EEPGD = 1;		\
					WREN=1;			\
					EECON2 = 0x55;		\
					EECON2 = 0xaa;		\
					WR=1;			\
					asm("nop");		\
					asm("nop");		\
              				WREN=0

#define FLASH_READ(addr)		EEADR=((addr)&0xff);	\
					EEADRH=((addr)>>8);	\
					WREN=0;			\
					EEPGD = 1;		\
					RD=1;			\
					asm("nop");		\
					asm("nop");		\
					((EEDATH << 8) | EEDATA)

/* library function versions */
					
extern void eeprom_write(unsigned char addr, unsigned char value);
extern unsigned char eeprom_read(unsigned char addr);
					
// Configuration Mask Definitions
#define CONFIG_ADDR	0x2007
//...

#endif
